# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [26]:
# your answer here
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [10]:
# your answer here
employee = pd.read_csv('data/Employee.csv')

In [11]:
employee.columns

Index(['Name', 'Department', 'Education', 'Gender', 'Title', 'Years',
       'Salary'],
      dtype='object')

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [31]:
# Method 1
# your answer here
mean_salary_by_dept = employee.groupby('Department')['Salary'].mean()
mean_salary_by_dept

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [32]:
mean_salary_by_dept_pivot = pd.pivot_table(employee, values='Salary', index='Department', aggfunc='mean')
mean_salary_by_dept_pivot

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [33]:
# Method 2
# your answer here

In [34]:
# your answer here
mean_salary_by_dept_title = pd.pivot_table(employee, values='Salary', index=['Department', 'Title'], aggfunc='mean')
mean_salary_by_dept_title

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [35]:
# your answer here

In [36]:
pivot_years_salary_title = pd.pivot_table(employee, values='Salary', index='Title', columns='Years', aggfunc='mean').reset_index()
pivot_years_salary_title

Years      Title     1     2     3     4     7     8
0             VP   NaN   NaN   NaN   NaN   NaN  70.0
1        analyst  35.0  30.0   NaN  35.0   NaN   NaN
2      associate   NaN  55.0  55.0   NaN  60.0   NaN

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [37]:
# your answer here

In [38]:
pivot_dept_title_salary = pd.pivot_table(employee, values=['Salary'], index=['Department', 'Title'], aggfunc=['mean', 'count']).reset_index()
pivot_dept_title_salary

  Department      Title   mean  count
                        Salary Salary
0         HR         VP   70.0      1
1         HR    analyst   32.5      2
2         IT         VP   70.0      1
3         IT    analyst   32.5      2
4         IT  associate   60.0      1
5      Sales  associate   55.0      2

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [39]:
# your answer here

In [40]:
pivot_salary_stats = pd.pivot_table(employee, values='Salary', index=['Department', 'Title'], aggfunc=[np.median, np.min, np.max, np.std])
pivot_salary_stats

                     median   amin   amax       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [41]:
# your answer here
pivot_salary_dept_title = pd.pivot_table(employee, values='Salary', index=['Department', 'Title'], aggfunc=['median', 'min', 'max', 'std']).fillna(0)
pivot_salary_dept_title

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  0.000000
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [ ]:
# your answer here

In [43]:
pivot_dept_salary = pd.pivot_table(employee, values='Salary', index='Department', aggfunc=['count', 'sum'])
pivot_dept_salary.columns = ['Num_of_Employees', 'Total_Salary']
pivot_dept_salary

            Num_of_Employees  Total_Salary
Department
HR                         3           135
IT                         4           195
Sales                      2           110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [44]:
# your answer here

In [45]:
pivot_years_salary_title = pd.pivot_table(employee, values=['Years', 'Salary'], index=['Department', 'Title'], aggfunc={'Years': 'sum', 'Salary': 'mean'}).reset_index()
pivot_years_salary_title

  Department      Title  Salary  Years
0         HR         VP    70.0      8
1         HR    analyst    32.5      6
2         IT         VP    70.0      8
3         IT    analyst    32.5      3
4         IT  associate    60.0      7
5      Sales  associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here